app/Http/Controllers/Api/AuthController.php

select exists(select * from `customers` where `email` = 'mynula@mailinator.com' and `customers`.`deleted_at` is null) as `exists`
---
    public function register(RegisterRequest $request)
    {
        $otpSent = new SendOtpCode($request);
        try {

            $col_name = is_numeric($request->credential) ? 'phone' : 'email';

            $customer = Customer::where($col_name, $request->credential)->exists();