app/Http/Controllers/Api/CategoryController.php

    public function index()
    {
        $categories = Category::isParent()
            ->with('translates')
            ->orderBy('name', 'asc')
            ->get();
---
select * from `categories` where `parent_id` is null and `categories`.`deleted_at` is null order by `name` asc