app/Http/Controllers/Api/LanguageController.php

    public function index()
    {
        $languages = Language::active()->get();
---
select * from `languages` where `active` = 'active'