app/Http/Controllers/Api/LocalizationController.php

select * from `languages` where `languages`.`id` in (1, 2)
---
    public function index()
    {
        $local = Localization::with('language')->get()
            ->groupBy('language.code')
            ->map(function ($query) {
                return $query->pluck('value', 'key');
            });