app/Http/Middleware/HandleInertiaRequests.php

select * from `languages` where `active` = 'active'
select `value`, `key` from `settings`
---
    public function share(Request $request): array
    {
        // return [
        //     ...parent::share($request),
        //     'ziggy' => fn () => [
        //         ...(new Ziggy)->toArray(),
        //         'location' => $request->url(),
        //     ],
        // ];

        return array_merge(parent::share($request), [
            'auth.user' => fn() => $request->user() ? new UserResource($request->user()) : null,
            'languages' => fn() => Language::active()->get(),
            'api_token' => fn() => encryptApiToken(),
            'site_name' => Setting::getValueByKey('app_name'),
            'settings'  => Setting::pluck('value', 'key')->toArray(),